{
  "categories": [
    {
      "name": "Romantic Reflections",
      "questions": [
        "What was your first impression of me?",
        "What's your favorite memory of us?",
        "What does love mean to you?",
        "How do you know when you're truly in love?",
        "What's something romantic you've always wanted to try?",
        "What's your love language?",
        "What's a song that reminds you of us?",
        "What's your idea of a perfect date?",
        "Do you believe in soulmates?",
        "What's a romantic gesture that melted your heart?",
        "What's your dream honeymoon destination?",
        "What's a romantic movie that made you cry?",
        "What's your favorite way to spend a lazy day together?",
        "How do you feel when we're apart?",
        "What's a small thing I do that makes a big impact on you?",
        "What's your favorite physical feature of mine?",
        "What's your favorite non-physical trait of mine?",
        "What's something you've learned about love from our relationship?",
        "What's one thing you want us to do more often?",
        "What's a tradition you'd love to start with me?",
        "What's your favorite compliment I've ever given you?",
        "What's a moment you knew you loved me?",
        "What's a romantic fantasy you've never shared?",
        "What's your favorite way to say 'I love you' without words?",
        "What's something you want to do together every anniversary?",
        "What's a love story that inspires you?",
        "What's your favorite thing about our relationship?",
        "What's a romantic surprise you'd love to receive?",
        "What's your favorite photo of us?",
        "What's a romantic memory you replay in your mind?",
        "What's something you want to write about our love?",
        "What's a place that feels romantic to you?",
        "What's your favorite way to cuddle?",
        "What's a romantic quote that speaks to you?",
        "What's a moment you felt truly seen by me?",
        "What's something you want to promise me?",
        "What's your favorite way to spend a night in together?",
        "What's a romantic song you'd dedicate to me?",
        "What's a love letter you wish you'd received?",
        "What's something you want to do for me just because?",
        "What's your favorite romantic movie scene?",
        "What's a romantic tradition you admire from another culture?",
        "What's your favorite thing to do when we're alone?",
        "What's a romantic dream you've had about us?",
        "What's something you want to do for our next date?",
        "What's a way you show love that people often miss?",
        "What's your favorite romantic gift you've ever given or received?",
        "What's a moment you felt butterflies with me?",
        "What's something romantic you want to do this year?",
        "What's a way we can celebrate our love more often?"
      ]
    },
    {
      "name": "Fun & Silly",
      "questions": [
        "If we were a famous duo, who would we be?",
        "What's the weirdest food combo you secretly love?",
        "If you could have any superpower, what would it be?",
        "What's your guilty pleasure TV show?",
        "If you were an animal, what would you be and why?",
        "What's the silliest thing you believed as a kid?",
        "What's your go-to karaoke song?",
        "If you could swap lives with a celebrity for a day, who would it be?",
        "What's the most ridiculous thing you've ever done for fun?",
        "If you had a theme song, what would it be?",
        "What's your zombie apocalypse survival plan?",
        "What's your favorite meme or viral video?",
        "If you had to eat one food forever, what would it be?",
        "What's your weirdest talent?",
        "What's a fictional world you wish you could live in?",
        "If you could invent a holiday, what would it celebrate?",
        "What's your dream costume for a couple's Halloween party?",
        "What's the funniest thing you've ever witnessed?",
        "If you had a personal mascot, what would it look like?",
        "What's your favorite childhood game?",
        "If you were a cartoon character, who would you be?",
        "What's the most embarrassing thing that's ever happened to you?",
        "What's your favorite pun or dad joke?",
        "If you could prank anyone without consequences, who would it be?",
        "What's your favorite silly dance move?",
        "What's the weirdest dream you've ever had?",
        "If you had a silly nickname, what would it be?",
        "What's your favorite animal noise to imitate?",
        "If you could be famous for something ridiculous, what would it be?",
        "What's your favorite funny face to make?",
        "What's a food you love that most people hate?",
        "If you could live in a sitcom, which one would it be?",
        "What's your favorite childhood cartoon?",
        "What's the most random fact you know?",
        "If you had a silly superpower, what would it be?",
        "What's your favorite parody song?",
        "What's the weirdest thing you've ever Googled?",
        "If you could create a silly app, what would it do?",
        "What's your favorite joke that never gets old?",
        "What's the most unusual compliment you've ever received?",
        "If you could talk to animals, what's the first thing you'd ask?",
        "What's your favorite funny sound effect?",
        "If you had a silly walk, what would it look like?",
        "What's your favorite ridiculous conspiracy theory?",
        "If you could rename everyday objects, what's the first one you'd change?",
        "What's your favorite way to make someone laugh?",
        "What's the most absurd thing you've ever done on a dare?",
        "If you had a personal catchphrase, what would it be?",
        "What's your favorite funny voice to use?",
        "What's the most hilarious autocorrect fail you've seen?"
      ]
    },
    {
      "name": "Relationship Growth",
      "questions": [
        "What's something you've learned from me?",
        "What's a challenge we've overcome together?",
        "What's a habit we've built that makes our relationship stronger?",
        "What's something you admire about how we communicate?",
        "What's a moment you felt especially close to me?",
        "What's something you want us to improve together?",
        "What's a boundary that's important to you?",
        "What's a way we can support each other better?",
        "What's something you've never told me but want to?",
        "What's a shared goal you're excited about?",
        "What's a ritual we've created that you love?",
        "What's a way we've grown as a couple?",
        "What's something you want to learn about me?",
        "What's a way we can deepen our emotional connection?",
        "What's something you appreciate that I do regularly?",
        "What's a way we've helped each other heal?",
        "What's a moment you felt truly understood by me?",
        "What's a way we can celebrate our love more often?",
        "What's something you want to do together every year?",
        "What's a way we've built trust?",
        "What's something you want to work on personally for our relationship?",
        "What's a moment you felt proud of us?",
        "What's something you admire about my values?",
        "What's a way we've become more patient with each other?",
        "What's something you want to do differently in future arguments?",
        "What's a way we've become better listeners?",
        "What's something you want to explore together emotionally?",
        "What's a way we've shown resilience?",
        "What's something you want to be more intentional about?",
        "What's a moment that made you feel safe with me?",
        "What's a way we've grown in trust?",
        "What's something you want to be more vulnerable about?",
        "What's a moment you felt deep emotional intimacy?",
        "What's a way we've supported each other's growth?",
        "What's something you want to understand better about me?",
        "What's a way we've handled conflict well?",
        "What's something you want to express more often?",
        "What's a moment you felt proud of how we handled a challenge?",
        "What's a way we've built emotional safety?",
        "What's something you want to do to nurture our bond?",
        "What's a moment you felt completely accepted?",
        "What's a way we've grown in empathy?",
        "What's something you want to be more open about?",
        "What's a moment you felt our relationship deepen?",
        "What's a way we've become more emotionally intelligent?",
        "What's something you want to do to honor our connection?",
        "What's a moment you felt truly heard?",
        "What's a way we've grown in compassion?",
        "What's something you want to do to strengthen our foundation?",
        "What's a moment you felt unconditional love?"
      ]
    },
    {
      "name": "Getting to Know You",
      "questions": [
        "What's your favorite childhood memory?",
        "What's a hobby you've always wanted to try?",
        "What's your biggest pet peeve?",
        "What's your favorite way to relax?",
        "What's your dream job as a kid?",
        "What's your favorite season and why?",
        "What's your favorite holiday tradition?",
        "What's a food you can't stand?",
        "What's your favorite thing to do on weekends?",
        "What's your favorite book of all time?",
        "What's your favorite movie genre?",
        "What's your go-to comfort food?",
        "What's your favorite thing about your hometown?",
        "What's a talent you wish you had?",
        "What's your favorite way to spend a rainy day?",
        "What's your favorite childhood toy?",
        "What's your favorite family tradition?",
        "What's your favorite thing to cook or bake?",
        "What's your favorite kind of music?",
        "What's your favorite way to celebrate your birthday?",
        "What's a subject you loved in school?",
        "What's your favorite ice cream flavor?",
        "What's a language you'd love to learn?",
        "What's your favorite thing to wear?",
        "What's your favorite outdoor activity?",
        "What's a weird habit you have?",
        "What's your favorite way to spend a Sunday morning?",
        "What's a game you're really good at?",
        "What's your favorite childhood TV show?",
        "What's your favorite thing to do when you're bored?",
        "What's a smell that brings back memories?",
        "What's your favorite breakfast food?",
        "What's a place you've always wanted to visit?",
        "What's your favorite thing to do alone?",
        "What's your favorite thing to do with friends?",
        "What's a nickname you've had?",
        "What's your favorite dessert?",
        "What's your favorite color and why?",
        "What's your favorite holiday?",
        "What's your favorite thing to do in nature?",
        "What's a tradition you want to start?",
        "What's your favorite thing to do at night?",
        "What's your favorite way to treat yourself?",
        "What's your favorite childhood book?",
        "What's your favorite thing to do when you're feeling down?",
        "What's your favorite way to stay active?",
        "What's your favorite thing to do on vacation?",
        "What's your favorite thing to do when you're feeling creative?",
        "What's your favorite way to spend time with family?",
        "What's your favorite way to unwind after a long day?"
      ]
    },
    {
      "name": "Travel & Adventure",
      "questions": [
        "What's your dream travel destination?",
        "What's the most adventurous thing you've ever done?",
        "What's a country you'd love to explore together?",
        "What's your ideal road trip route?",
        "What's your favorite travel memory?",
        "What's a travel experience that changed you?",
        "What's your favorite way to travel—plane, train, car?",
        "What's a place you'd love to revisit?",
        "What's your favorite travel snack?",
        "What's a travel tradition you'd like to start?",
        "What's your favorite travel photo of us?",
        "What's a city you'd love to live in for a year?",
        "What's your favorite travel outfit?",
        "What's a travel mistake you learned from?",
        "What's your favorite hotel or Airbnb experience?",
        "What's a travel goal you want to achieve?",
        "What's a place you'd love to see at sunrise?",
        "What's your favorite travel souvenir?",
        "What's a travel bucket list item we should do together?",
        "What's your favorite travel playlist?",
        "What's a place you'd love to visit in every season?",
        "What's your favorite travel app or tool?",
        "What's a local dish you've tried and loved?",
        "What's a travel moment that made you laugh?",
        "What's a destination that surprised you?",
        "What's your favorite travel ritual?",
        "What's a place you'd love to get lost in?",
        "What's a travel experience you'd recommend to everyone?",
        "What's a place you'd love to visit for its history?",
        "What's your favorite travel companion trait?",
        "What's a travel moment that made you feel free?",
        "What's a place you'd love to visit for its nature?",
        "What's a travel moment that made you feel small in a good way?",
        "What's a place you'd love to visit for its culture?",
        "What's your favorite travel game or activity?",
        "What's a travel moment that made you feel connected?",
        "What's a place you'd love to visit for its architecture?",
        "What's your favorite travel photo you've ever taken?",
        "What's a travel moment that made you feel brave?",
        "What's a place you'd love to visit for its food?",
        "What's your favorite travel quote?",
        "What's a travel moment that made you feel grateful?",
        "What's a place you'd love to visit for its art?",
        "What's your favorite travel challenge?",
        "What's a travel moment that made you feel inspired?",
        "What's a place you'd love to visit for its music?",
        "What's your favorite travel tradition you want to keep?",
        "What's a travel moment that made you feel adventurous?",
        "What's a place you'd love to visit for its wildlife?",
        "What's your favorite travel memory with me?"
      ]
    },
    {
      "name": "Family & Upbringing",
      "questions": [
        "What's a value your family taught you?",
        "What's your relationship like with your siblings?",
        "What's a tradition from your childhood you still cherish?",
        "What's a lesson your parents taught you?",
        "What's your favorite family meal?",
        "What's a holiday memory from childhood?",
        "What's something you want to pass on to future generations?",
        "What's a story your family always tells?",
        "What's a nickname you had growing up?",
        "What's your favorite thing about your family culture?",
        "What's a family recipe you love?",
        "What's a childhood game you remember fondly?",
        "What's a family value you want in our relationship?",
        "What's a way your upbringing shaped your personality?",
        "What's a family tradition you'd like to recreate?",
        "What's a moment you felt proud of your family?",
        "What's a way your family shows love?",
        "What's a family vacation you'll never forget?",
        "What's something you wish your family did differently?",
        "What's a family heirloom or keepsake you treasure?",
        "What's a childhood memory that makes you smile?",
        "What's a family rule you didn't understand as a kid?",
        "What's a moment you felt really close to your parents?",
        "What's a family celebration you always looked forward to?",
        "What's a way your family handled conflict?",
        "What's a tradition you want to start with your own family?",
        "What's a family member who inspires you?",
        "What's a childhood home like?",
        "What's a family saying or phrase you still use?",
        "What's a moment you felt misunderstood by your family?",
        "What's a family holiday tradition you want to keep?",
        "What's a way your family supported you growing up?",
        "What's a family moment that made you laugh?",
        "What's a family value you want to challenge?",
        "What's a moment you felt proud of your heritage?",
        "What's a family recipe you want to pass down?",
        "What's a childhood tradition you want to revive?",
        "What's a moment you felt protected by your family?",
        "What's a family story that shaped your identity?",
        "What's a moment you felt truly loved by your family?",
        "What's a family tradition you want to evolve?",
        "What's a way your family celebrated milestones?",
        "What's a family moment that taught you resilience?",
        "What's a childhood experience that shaped your beliefs?",
        "What's a family value you want to teach your children?",
        "What's a moment you felt your family's pride?",
        "What's a family tradition you want to share with me?",
        "What's a way your family expressed affection?",
        "What's a moment you realized your family's uniqueness?",
        "What's a family moment you'll never forget?"
      ]
    },
    {
      "name": "Dreams & Ambitions",
      "questions": [
        "What's a dream you've never shared with anyone?",
        "What motivates you to keep going?",
        "What's a personal goal you're working on?",
        "What's a dream you've had since childhood?",
        "What's a career milestone you're proud of?",
        "What's a skill you want to master?",
        "What's a dream you want us to chase together?",
        "What's a passion project you'd love to start?",
        "What's a vision you have for your future?",
        "What's a dream that scares you?",
        "What's a goal you've achieved that felt impossible?",
        "What's a dream you've put on hold?",
        "What's a way you define success?",
        "What's a dream you've outgrown?",
        "What's a goal you want to reach in the next year?",
        "What's a dream that keeps you up at night?",
        "What's a legacy you want to leave?",
        "What's a dream you want to share with me?",
        "What's a challenge you're ready to face?",
        "What's a dream that feels within reach right now?",
        "What's a dream you want to pursue no matter what?",
        "What's a goal you want to accomplish before turning 40?",
        "What's a dream you want to revisit?",
        "What's a dream that makes you feel alive?",
        "What's a dream you want to turn into a tradition?",
        "What's a goal you want to celebrate with loved ones?",
        "What's a dream that changed your perspective?",
        "What's a dream you've had more than once?",
        "What's a dream you want to write about?",
        "What's a dream that feels too big to say out loud?",
        "What's a dream you want to build with your partner?",
        "What's a dream that's evolved over time?",
        "What's a dream that came true unexpectedly?",
        "What's a dream you want to protect fiercely?",
        "What's a dream that reflects your values?",
        "What's a dream you want to dedicate time to this year?",
        "What's a dream that feels urgent?",
        "What's a dream you want to share with future generations?",
        "What's a dream that brings you peace?",
        "What's a dream that energizes you?",
        "What's a dream you want to visualize every day?",
        "What's a dream that's tied to your identity?",
        "What's a dream that's been shaped by your experiences?",
        "What's a dream you want to pursue with full heart?",
        "What's a dream that's waiting for the right moment?",
        "What's a dream that's rooted in love?",
        "What's a dream that challenges you?",
        "What's a dream that feels like destiny?",
        "What's a dream you want to nurture slowly?",
        "What's a dream that makes you feel limitless?",
        "What's a dream you want to start today?"
      ]
    },
    {
      "name": "Rapid Fire: This or That",
      "questions": [
        "Coffee or tea?",
        "Beach or mountains?",
        "Books or movies?",
        "Sweet or savory?",
        "Cats or dogs?",
        "Morning or night?",
        "Dancing or singing?",
        "Texting or calling?",
        "Comedy or drama?",
        "Pizza or tacos?",
        "City or countryside?",
        "Sunrise or sunset?",
        "Chocolate or vanilla?",
        "Adventure or relaxation?",
        "Rainy day or sunny day?",
        "Board games or video games?",
        "Camping or glamping?",
        "Spontaneous or planner?",
        "Classic romance or modern love?",
        "Ice cream or cake?",
        "Sneakers or sandals?",
        "Concert or museum?",
        "Jeans or sweatpants?",
        "Cook at home or dine out?",
        "Netflix or YouTube?",
        "Hiking or biking?",
        "Winter or summer?",
        "Pen or pencil?",
        "Ocean or lake?",
        "Plane or train?",
        "Instagram or TikTok?",
        "Hot tub or pool?",
        "Early bird or night owl?",
        "Sushi or burgers?",
        "Text or voice message?",
        "Bookshelf or Kindle?",
        "Road trip or cruise?",
        "Popcorn or candy?",
        "Art gallery or amusement park?",
        "Spicy or mild?",
        "Live music or DJ?",
        "Puzzles or riddles?",
        "Sweater or hoodie?",
        "Fiction or nonfiction?",
        "Tea party or barbecue?",
        "Sunblock or sunglasses?",
        "Group hangout or one-on-one?",
        "Fireplace or firepit?",
        "Surprise or plan ahead?",
        "Minimalist or maximalist?"
      ]
    },
    {
      "name": "Personal Growth & Self-Discovery",
      "questions": [
        "What's a habit that's changed your life?",
        "What's something you've recently learned about yourself?",
        "What's a fear you've overcome?",
        "What's a personal boundary you've set and why?",
        "What's a moment you felt truly empowered?",
        "What's a part of yourself you're working to accept?",
        "What's a challenge that helped you grow?",
        "What's a mindset shift that changed everything for you?",
        "What's a value you live by?",
        "What's a part of your personality you're proud of?",
        "What's something you've forgiven yourself for?",
        "What's a goal you've achieved that made you stronger?",
        "What's a lesson you learned from failure?",
        "What's a part of your identity you're still exploring?",
        "What's a moment you felt completely authentic?",
        "What's a belief that guides your decisions?",
        "What's something you've let go of that brought peace?",
        "What's a way you've become more confident?",
        "What's a moment you realized your own strength?",
        "What's a personal ritual that grounds you?",
        "What's a way you've grown emotionally?",
        "What's something you've learned from solitude?",
        "What's a moment you felt deeply connected to yourself?",
        "What's a way you've become more self-aware?",
        "What's a part of your story you're proud to share?",
        "What's a moment that taught you resilience?",
        "What's something you've learned about your emotions?",
        "What's a way you've become more compassionate?",
        "What's a moment you chose growth over comfort?",
        "What's a part of your past you've made peace with?",
        "What's a way you've become more mindful?",
        "What's a moment you felt truly free?",
        "What's something you've learned about your needs?",
        "What's a way you've become more intentional?",
        "What's a moment you felt proud of your progress?",
        "What's a part of yourself you're rediscovering?",
        "What's a way you've become more curious?",
        "What's a moment you felt aligned with your purpose?",
        "What's something you've learned about your triggers?",
        "What's a way you've become more open-minded?",
        "What's a moment you felt deep clarity?",
        "What's something you've learned about your strengths?",
        "What's a way you've become more grounded?",
        "What's a moment you felt true inner peace?",
        "What's something you've learned about your intuition?",
        "What's a way you've become more adaptable?",
        "What's a moment you felt proud of your authenticity?",
        "What's something you've learned about your boundaries?",
        "What's a way you've become more emotionally intelligent?",
        "What's a moment you felt proud of your self-respect?"
      ]
    },
    {
      "name": "Playful Hypotheticals",
      "questions": [
        "If you could live in any fictional universe, which one would it be?",
        "If you could time travel, where would you go first?",
        "If you won the lottery tomorrow, what's the first thing you'd buy?",
        "If you could switch lives with anyone for a day, who would it be?",
        "If you had a personal theme song, what would it be?",
        "If you could speak any language instantly, which one would you choose?",
        "If you could have dinner with any historical figure, who would it be?",
        "If you were invisible for a day, what would you do?",
        "If you could teleport anywhere right now, where would you go?",
        "If you had to live in a movie for a week, which one would it be?",
        "If you could master any skill overnight, what would it be?",
        "If you could be famous for something, what would it be?",
        "If you could live in any era, which one would you choose?",
        "If you could create a new law, what would it be?",
        "If you could have any animal as a pet, what would it be?",
        "If you could instantly learn a musical instrument, which one would it be?",
        "If you could swap jobs with anyone, who would it be?",
        "If you could live on another planet, which one would you choose?",
        "If you could erase one chore from your life, what would it be?",
        "If you could design your dream house, what would it include?",
        "If you could be any age forever, what age would you choose?",
        "If you could invent a gadget, what would it do?",
        "If you could live in any city in the world, where would it be?",
        "If you could be a character in a book, who would you be?",
        "If you could change your name, what would you pick?",
        "If you could have any job for a week, what would it be?",
        "If you could live underwater, what would your home look like?",
        "If you could create a new holiday, what would it celebrate?",
        "If you could be a master chef in one cuisine, which would it be?",
        "If you could have a secret talent, what would it be?",
        "If you could live in a treehouse, what would it look like?",
        "If you could be a superhero, what would your powers be?",
        "If you could live in a video game, which one would it be?",
        "If you could be a contestant on any game show, which one?",
        "If you could have a robot assistant, what would it do?",
        "If you could live in a musical, which one would you choose?",
        "If you could be any mythical creature, what would you be?",
        "If you could create your own country, what would it be called?",
        "If you could live in a castle, what would it be like?",
        "If you could be a master of disguise, what would you do first?",
        "If you could live in a floating city, what would it be named?",
        "If you could have a magical garden, what would grow there?",
        "If you could be a professional athlete, what sport would you play?",
        "If you could live in a cloud, what would your home look like?",
        "If you could be a famous inventor, what would you invent?",
        "If you could live in a movie theater, what would be playing?",
        "If you could be a travel blogger, where would you go first?",
        "If you could live in a candy world, what would be your house?",
        "If you could be a pirate, what would your ship be named?",
        "If you could live in a dream, what would it be about?"
      ]
    },
    {
      "name": "Intimacy & Vulnerability",
      "questions": [
        "What's a moment you felt emotionally exposed with me?",
        "What's something you're afraid to say out loud?",
        "What's a fear you've never shared before?",
        "What's a way you feel safest with me?",
        "What's something you've never told anyone else?",
        "What's a moment you felt deeply understood?",
        "What's a part of yourself you're still learning to reveal?",
        "What's something you want to be more open about?",
        "What's a way you show vulnerability?",
        "What's a moment you felt emotionally naked?",
        "What's something you need when you're hurting?",
        "What's a way I can support you when you're struggling?",
        "What's a moment you felt completely accepted?",
        "What's something you're still healing from?",
        "What's a way you cope with emotional pain?",
        "What's a moment you felt raw and real?",
        "What's something you wish people knew about your inner world?",
        "What's a way you express your deepest feelings?",
        "What's a moment you cried and felt relief?",
        "What's something you're afraid of losing?",
        "What's a way you protect your heart?",
        "What's a moment you felt emotionally safe?",
        "What's something you've never admitted to yourself?",
        "What's a way you've learned to trust?",
        "What's a moment you felt emotionally overwhelmed?",
        "What's something you want to share but don't know how?",
        "What's a way you've grown through emotional pain?",
        "What's a moment you felt emotionally naked but loved?",
        "What's something you want to say but fear the reaction?",
        "What's a way you've learned to be vulnerable?",
        "What's a moment you felt emotionally fragile?",
        "What's something you've hidden out of fear?",
        "What's a way you've opened up to someone?",
        "What's a moment you felt emotionally brave?",
        "What's something you want to be seen for?",
        "What's a way you've learned to ask for help?",
        "What's a moment you felt emotionally exposed but supported?",
        "What's something you've never said out loud but want to?",
        "What's a way you've learned to sit with discomfort?",
        "What's a moment you felt emotionally raw?",
        "What's something you want to be more honest about?",
        "What's a way you've learned to be emotionally present?",
        "What's a moment you felt emotionally close to someone?",
        "What's something you've shared that felt risky?",
        "What's a way you've learned to express your needs?",
        "What's a moment you felt emotionally seen?",
        "What's something you've never shared with a partner?",
        "What's a way you've learned to be emotionally available?",
        "What's a moment you felt emotionally naked and accepted?",
        "What's something you want to be vulnerable about with me?"
      ]
    },
    {
      "name": "Life Philosophy & Beliefs",
      "questions": [
        "What's your personal definition of happiness?",
        "What do you believe is the purpose of life?",
        "What's a value you'll never compromise on?",
        "Do you believe everything happens for a reason?",
        "What's your philosophy on forgiveness?",
        "What does freedom mean to you?",
        "What's your view on fate versus free will?",
        "What's a belief that guides your decisions?",
        "Do you believe people can truly change?",
        "What's your stance on second chances?",
        "What does success mean to you?",
        "What's your view on spirituality?",
        "Do you believe in karma?",
        "What's your philosophy on happiness?",
        "What's a belief you've challenged recently?",
        "Do you believe in destiny?",
        "What's your view on morality?",
        "What does integrity mean to you?",
        "Do you believe in soul connections?",
        "What's your philosophy on love?",
        "What's a belief that brings you peace?",
        "Do you believe in life after death?",
        "What's your view on ambition?",
        "What does balance mean to you?",
        "Do you believe in universal truth?",
        "What's your philosophy on growth?",
        "What's a belief that shapes your identity?",
        "Do you believe in luck?",
        "What's your view on vulnerability?",
        "What does authenticity mean to you?",
        "Do you believe in signs from the universe?",
        "What's your philosophy on relationships?",
        "What's a belief that gives you strength?",
        "Do you believe in reincarnation?",
        "What's your view on justice?",
        "What does compassion mean to you?",
        "Do you believe in miracles?",
        "What's your philosophy on time?",
        "What's a belief that challenges you?",
        "Do you believe in absolute truth?",
        "What's your view on legacy?",
        "What does courage mean to you?",
        "Do you believe in divine timing?",
        "What's your philosophy on failure?",
        "What's a belief that inspires you?",
        "Do you believe in energy and vibration?",
        "What's your view on self-worth?",
        "What does wisdom mean to you?",
        "Do you believe in collective consciousness?",
        "What's your philosophy on purpose?"
      ]
    },
    {
      "name": "Memories & Milestones",
      "questions": [
        "What's your earliest memory?",
        "What's a milestone you're proud of?",
        "What's a moment that changed your life?",
        "What's a memory that always makes you smile?",
        "What's a moment you'll never forget?",
        "What's a memory that shaped who you are?",
        "What's a birthday you'll always remember?",
        "What's a moment you felt truly celebrated?",
        "What's a memory that brings you peace?",
        "What's a moment you felt unstoppable?",
        "What's a memory that makes you laugh every time?",
        "What's a milestone you didn't think you'd reach?",
        "What's a memory you wish you could relive?",
        "What's a moment you felt deeply loved?",
        "What's a memory that reminds you of home?",
        "What's a moment you felt truly seen?",
        "What's a milestone that felt surreal?",
        "What's a memory that brings you comfort?",
        "What's a moment you felt proud of someone else?",
        "What's a memory that taught you something important?",
        "What's a milestone you want to celebrate again?",
        "What's a moment you felt completely free?",
        "What's a memory that makes you emotional?",
        "What's a moment you felt like you belonged?",
        "What's a milestone that marked a new chapter?",
        "What's a memory that feels like a dream?",
        "What's a moment you felt brave?",
        "What's a milestone you want to share with others?",
        "What's a memory that feels magical?",
        "What's a moment you felt truly alive?",
        "What's a milestone that took hard work?",
        "What's a memory that makes you nostalgic?",
        "What's a moment you felt like everything clicked?",
        "What's a milestone you want to honor?",
        "What's a memory that reminds you of your strength?",
        "What's a moment you felt deeply connected to someone?",
        "What's a milestone that surprised you?",
        "What's a memory that feels sacred?",
        "What's a moment you felt like your best self?",
        "What's a milestone you want to commemorate?",
        "What's a memory that makes you feel grateful?",
        "What's a moment you felt truly understood?",
        "What's a milestone that changed your perspective?",
        "What's a memory that feels like a turning point?",
        "What's a moment you felt complete joy?",
        "What's a milestone that felt like a breakthrough?",
        "What's a memory that reminds you of growth?",
        "What's a moment you felt deeply inspired?",
        "What's a milestone you want to revisit?",
        "What's a memory that feels timeless?",
        "What's a moment you'll cherish forever?"
      ]
    },
    {
      "name": "Favorites & Preferences",
      "questions": [
        "What's your favorite movie of all time?",
        "What's your favorite book?",
        "What's your favorite song right now?",
        "What's your favorite meal to cook?",
        "What's your favorite dessert?",
        "What's your favorite holiday?",
        "What's your favorite season?",
        "What's your favorite color and why?",
        "What's your favorite way to relax?",
        "What's your favorite weekend activity?",
        "What's your favorite childhood toy?",
        "What's your favorite type of weather?",
        "What's your favorite place to visit?",
        "What's your favorite thing to wear?",
        "What's your favorite scent?",
        "What's your favorite drink?",
        "What's your favorite way to spend a day off?",
        "What's your favorite type of cuisine?",
        "What's your favorite animal?",
        "What's your favorite ice cream flavor?",
        "What's your favorite TV show?",
        "What's your favorite podcast?",
        "What's your favorite way to celebrate?",
        "What's your favorite thing to do with friends?",
        "What's your favorite board game?",
        "What's your favorite video game?",
        "What's your favorite app?",
        "What's your favorite way to exercise?",
        "What's your favorite breakfast food?",
        "What's your favorite thing to do when you're bored?",
        "What's your favorite quote?",
        "What's your favorite thing about weekends?",
        "What's your favorite thing to do outdoors?",
        "What's your favorite thing to do indoors?",
        "What's your favorite childhood memory?",
        "What's your favorite way to treat yourself?",
        "What's your favorite thing to do on vacation?",
        "What's your favorite thing to do when you're feeling creative?",
        "What's your favorite way to unwind after a long day?",
        "What's your favorite thing to do when you're feeling down?",
        "What's your favorite way to show love?",
        "What's your favorite romantic gesture?",
        "What's your favorite thing about mornings?",
        "What's your favorite thing about nights?",
        "What's your favorite way to spend time with family?",
        "What's your favorite way to spend time alone?",
        "What's your favorite thing to do on a rainy day?",
        "What's your favorite thing to do on a sunny day?",
        "What's your favorite thing to do when you're feeling adventurous?",
        "What's your favorite thing to do when you're feeling lazy?"
      ]
    },
    {
      "name": "Conflict & Communication",
      "questions": [
        "What's your communication style during conflict?",
        "What's something that helps you feel heard?",
        "What's a way you prefer to resolve disagreements?",
        "What's a phrase that instantly calms you down?",
        "What's something you need during an argument?",
        "What's a way you show you're listening?",
        "What's a moment you felt misunderstood?",
        "What's a way you express frustration?",
        "What's something you struggle to say during conflict?",
        "What's a way you de-escalate tension?",
        "What's a moment you felt truly heard?",
        "What's a way you ask for space?",
        "What's something you appreciate during tough conversations?",
        "What's a way you show empathy?",
        "What's a moment you felt defensive and why?",
        "What's a way you express disagreement respectfully?",
        "What's something you wish people asked during conflict?",
        "What's a way you repair after a fight?",
        "What's a moment you felt proud of your communication?",
        "What's a way you express your needs clearly?",
        "What's something you've learned about arguing fairly?",
        "What's a way you stay calm under pressure?",
        "What's a moment you felt emotionally triggered?",
        "What's a way you ask for clarity?",
        "What's something you've learned about compromise?",
        "What's a way you express disappointment?",
        "What's a moment you felt emotionally flooded?",
        "What's a way you handle silence during conflict?",
        "What's something you need to feel safe in a disagreement?",
        "What's a way you express accountability?",
        "What's a moment you felt emotionally distant?",
        "What's a way you reconnect after conflict?",
        "What's something you've learned about tone of voice?",
        "What's a way you express boundaries?",
        "What's a moment you felt emotionally shut down?",
        "What's a way you ask for reassurance?",
        "What's something you've learned about timing in communication?",
        "What's a way you express regret?",
        "What's a moment you felt emotionally open?",
        "What's a way you ask for emotional support?",
        "What's something you've learned about listening?",
        "What's a way you express vulnerability during conflict?",
        "What's a moment you felt emotionally validated?",
        "What's a way you express forgiveness?",
        "What's something you've learned about emotional triggers?",
        "What's a way you express gratitude after resolution?",
        "What's a moment you felt emotionally reconnected?",
        "What's a way you express love during tension?",
        "What's something you've learned about emotional safety?",
        "What's a way you express your truth without fear?"
      ]
    },
    {
      "name": "Couple Goals & Shared Vision",
      "questions": [
        "What's a goal you want us to achieve together?",
        "What's a tradition you want to start as a couple?",
        "What's a shared dream we should pursue?",
        "What's a milestone you're excited to reach with me?",
        "What's a value you want us to live by?",
        "What's a way we can grow together?",
        "What's a vision you have for our future?",
        "What's a challenge you want us to tackle as a team?",
        "What's a lifestyle you imagine for us?",
        "What's a legacy you want to build together?",
        "What's a financial goal we should work toward?",
        "What's a travel goal we should plan?",
        "What's a home environment you want to create?",
        "What's a health goal we can support each other in?",
        "What's a creative project we could do together?",
        "What's a cause we could support as a couple?",
        "What's a way we can celebrate our love regularly?",
        "What's a communication goal we should set?",
        "What's a spiritual practice we could share?",
        "What's a way we can deepen our emotional intimacy?",
        "What's a parenting philosophy you'd want to explore?",
        "What's a holiday tradition we could invent?",
        "What's a way we can be more intentional together?",
        "What's a couple's challenge we should try?",
        "What's a way we can support each other's dreams?",
        "What's a shared bucket list item?",
        "What's a way we can stay connected during busy times?",
        "What's a goal we can revisit every year?",
        "What's a way we can grow in trust?",
        "What's a shared ritual we could create?",
        "What's a way we can be more playful together?",
        "What's a goal we can track together?",
        "What's a way we can show up for each other daily?",
        "What's a shared value we want to pass on?",
        "What's a way we can nurture our bond?",
        "What's a goal that excites you for our future?",
        "What's a way we can be more present with each other?",
        "What's a shared dream that feels bold?",
        "What's a way we can honor our relationship?",
        "What's a goal we can celebrate together?",
        "What's a way we can support each other's growth?",
        "What's a shared vision for our relationship?",
        "What's a way we can stay curious about each other?",
        "What's a goal we can work on this month?",
        "What's a way we can reflect on our journey?",
        "What's a shared value that guides us?",
        "What's a goal we can set for our next anniversary?",
        "What's a way we can be more adventurous together?",
        "What's a shared dream that feels meaningful?",
        "What's a way we can build something lasting?"
      ]
    },
    {
      "name": "Passions & Creativity",
      "questions": [
        "What's a creative outlet you love?",
        "What's a passion project you've dreamed of starting?",
        "What's something you've created that you're proud of?",
        "What's a hobby that makes you lose track of time?",
        "What's a way you express yourself artistically?",
        "What's a creative risk you've taken?",
        "What's a passion you want to explore more deeply?",
        "What's a moment you felt creatively inspired?",
        "What's a form of art that moves you?",
        "What's a creative challenge you've overcome?",
        "What's a passion that energizes you?",
        "What's a way you bring creativity into everyday life?",
        "What's a project you've always wanted to finish?",
        "What's a moment you felt creatively free?",
        "What's a passion you've had since childhood?",
        "What's a creative skill you admire in others?",
        "What's a way you express your imagination?",
        "What's a passion you want to share with others?",
        "What's a creative dream you've never spoken aloud?",
        "What's a moment you felt proud of your originality?",
        "What's a passion that feels like play?",
        "What's a creative habit you want to build?",
        "What's a way you use creativity to solve problems?",
        "What's a passion that brings you peace?",
        "What's a creative space you'd love to design?",
        "What's a moment you felt creatively brave?",
        "What's a passion you want to turn into a career?",
        "What's a way you express your inner world?",
        "What's a creative collaboration you'd love to try?",
        "What's a passion that makes you feel alive?",
        "What's a moment you felt creatively fulfilled?",
        "What's a passion you want to explore with me?",
        "What's a way you use creativity to connect with others?",
        "What's a creative tool you love using?",
        "What's a passion that challenges you?",
        "What's a moment you felt creatively curious?",
        "What's a passion you want to dedicate more time to?",
        "What's a way you express your emotions through art?",
        "What's a creative tradition you want to start?",
        "What's a passion that feels like your calling?",
        "What's a moment you felt creatively unstoppable?",
        "What's a passion you want to teach others?",
        "What's a way you use creativity to reflect on life?",
        "What's a creative process you enjoy?",
        "What's a passion that helps you grow?",
        "What's a moment you felt creatively connected to someone?",
        "What's a passion you want to explore in a new medium?",
        "What's a way you express your story through creativity?",
        "What's a creative dream you're ready to pursue?",
        "What's a passion that brings you joy?"
      ]
    },
    {
      "name": "Playful Challenges & Games",
      "questions": [
        "What's your favorite game to play together?",
        "What's a challenge we should try as a couple?",
        "What's a game you always win?",
        "What's a playful dare you'd give me?",
        "What's a challenge you'd love to conquer?",
        "What's a game you'd love to invent?",
        "What's a playful competition we should have?",
        "What's a challenge that makes you laugh?",
        "What's a game you loved as a kid?",
        "What's a playful bet you'd make with me?",
        "What's a challenge you'd try for a prize?",
        "What's a game you'd play on a rainy day?",
        "What's a playful twist you'd add to a classic game?",
        "What's a challenge you'd do for fun?",
        "What's a game you'd play on a road trip?",
        "What's a playful challenge we could do this weekend?",
        "What's a game you'd play with no rules?",
        "What's a challenge you'd do blindfolded?",
        "What's a playful game you'd make up on the spot?",
        "What's a challenge you'd do with music?",
        "What's a game you'd play with just words?",
        "What's a playful challenge you'd do in public?",
        "What's a game you'd play with food?",
        "What's a challenge you'd do in 60 seconds?",
        "What's a playful challenge you'd do with friends?",
        "What's a game you'd play with dice?",
        "What's a challenge you'd do with a timer?",
        "What's a playful challenge you'd do in nature?",
        "What's a game you'd play with cards?",
        "What's a challenge you'd do with costumes?",
        "What's a playful challenge you'd do at home?",
        "What's a game you'd play with music?",
        "What's a challenge you'd do with drawing?",
        "What's a playful challenge you'd do with dancing?",
        "What's a game you'd play with storytelling?",
        "What's a challenge you'd do with riddles?",
        "What's a playful challenge you'd do with photos?",
        "What's a game you'd play with emojis?",
        "What's a challenge you'd do with random objects?",
        "What's a playful challenge you'd do with accents?",
        "What's a game you'd play with trivia?",
        "What's a challenge you'd do with blind taste tests?",
        "What's a playful challenge you'd do with charades?",
        "What's a game you'd play with drawing?",
        "What's a challenge you'd do with singing?",
        "What's a playful challenge you'd do with whispering?",
        "What's a game you'd play with guessing?",
        "What's a challenge you'd do with storytelling?",
        "What's a playful challenge you'd do with roleplay?",
        "What's a game you'd play with random questions?"
      ]
    },
    {
      "name": "Sensory & Imaginative Experiences",
      "questions": [
        "What's a sound that instantly calms you?",
        "What's a scent that brings back memories?",
        "What's a texture you love to touch?",
        "What's a taste that reminds you of home?",
        "What's a visual that inspires you?",
        "What's a sound that makes you feel nostalgic?",
        "What's a scent that makes you feel safe?",
        "What's a texture that comforts you?",
        "What's a taste that excites you?",
        "What's a visual that sparks creativity?",
        "What's a sound that energizes you?",
        "What's a scent that makes you feel romantic?",
        "What's a texture that soothes you?",
        "What's a taste that feels indulgent?",
        "What's a visual that brings you peace?",
        "What's a sound that reminds you of childhood?",
        "What's a scent that makes you feel adventurous?",
        "What's a texture that feels luxurious?",
        "What's a taste that feels nostalgic?",
        "What's a visual that feels magical?",
        "What's a sound that makes you want to dance?",
        "What's a scent that reminds you of someone you love?",
        "What's a texture that feels grounding?",
        "What's a taste that feels comforting?",
        "What's a visual that feels cinematic?",
        "What's a sound that makes you feel connected?",
        "What's a scent that feels mysterious?",
        "What's a texture that feels playful?",
        "What's a taste that feels exotic?",
        "What's a visual that feels surreal?",
        "What's a sound that makes you feel powerful?",
        "What's a scent that feels energizing?",
        "What's a texture that feels familiar?",
        "What's a taste that feels refreshing?",
        "What's a visual that feels nostalgic?",
        "What's a sound that makes you feel peaceful?",
        "What's a scent that feels grounding?",
        "What's a texture that feels romantic?",
        "What's a taste that feels joyful?",
        "What's a visual that feels dreamlike?",
        "What's a sound that makes you feel inspired?",
        "What's a scent that feels calming?",
        "What's a texture that feels energizing?",
        "What's a taste that feels surprising?",
        "What's a visual that feels comforting?",
        "What's a sound that makes you feel curious?",
        "What's a scent that feels familiar?",
        "What's a texture that feels adventurous?",
        "What's a taste that feels nostalgic and warm?",
        "What's a visual that feels like a memory?"
      ]
    },
    {
      "name": "Love & Affection",
      "questions": [
        "What's your favorite way to receive affection?",
        "What's a gesture that makes you feel loved?",
        "What's a compliment that stayed with you?",
        "What's a moment you felt deeply cherished?",
        "What's a way you show love without words?",
        "What's a touch that comforts you?",
        "What's a phrase that makes you feel close?",
        "What's a moment you felt truly adored?",
        "What's a way you express affection daily?",
        "What's a moment you felt emotionally held?",
        "What's a love note you'd write me?",
        "What's a way you like to be surprised with love?",
        "What's a moment you felt completely accepted?",
        "What's a way you express love through actions?",
        "What's a moment you felt butterflies?",
        "What's a way you show affection in public?",
        "What's a moment you felt deeply connected?",
        "What's a way you express love through gifts?",
        "What's a moment you felt safe in love?",
        "What's a way you express love through time?",
        "What's a moment you felt love in silence?",
        "What's a way you express love through service?",
        "What's a moment you felt love through laughter?",
        "What's a way you express love through words?",
        "What's a moment you felt love through presence?",
        "What's a way you express love through touch?",
        "What's a moment you felt love through eye contact?",
        "What's a way you express love through creativity?",
        "What's a moment you felt love through support?",
        "What's a way you express love through listening?",
        "What's a moment you felt love through vulnerability?",
        "What's a way you express love through playfulness?",
        "What's a moment you felt love through patience?",
        "What's a way you express love through encouragement?",
        "What's a moment you felt love through kindness?",
        "What's a way you express love through shared experiences?",
        "What's a moment you felt love through understanding?",
        "What's a way you express love through rituals?",
        "What's a moment you felt love through forgiveness?",
        "What's a way you express love through consistency?",
        "What's a moment you felt love through celebration?",
        "What's a way you express love through attention?",
        "What's a moment you felt love through devotion?",
        "What's a way you express love through humor?",
        "What's a moment you felt love through silence?",
        "What's a way you express love through presence?",
        "What's a moment you felt love through words of affirmation?",
        "What's a way you express love through quality time?",
        "What's a moment you felt love through physical closeness?"
      ]
    }
  ]
}